
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/9918512211)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/detect"
        name                          = "detect"
      ~ runtime                       = "python310" -> "python311"
      ~ source_archive_object         = "functions/src_8f9b6f070b5694c891bb0a4dfa7e6715.zip" -> "functions/src_560dfe823a7eec016205219559dc4b4e.zip"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/piece"
        name                          = "piece"
      ~ runtime                       = "python310" -> "python311"
      ~ source_archive_object         = "functions/src_8f9b6f070b5694c891bb0a4dfa7e6715.zip" -> "functions/src_560dfe823a7eec016205219559dc4b4e.zip"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/submit"
        name                          = "submit"
      ~ runtime                       = "python310" -> "python311"
      ~ source_archive_object         = "functions/src_8f9b6f070b5694c891bb0a4dfa7e6715.zip" -> "functions/src_560dfe823a7eec016205219559dc4b4e.zip"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "1ThL+A==" -> (known after apply)
      ~ detect_md5hash      = "j5tvBwtWlMiRuwpN+n5nFQ==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-dev-deploy-functions/src_8f9b6f070b5694c891bb0a4dfa7e6715.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "j5tvBwtWlMiRuwpN+n5nFQ==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_8f9b6f070b5694c891bb0a4dfa7e6715.zip?generation=1720739915579608&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_8f9b6f070b5694c891bb0a4dfa7e6715.zip" -> "functions/src_560dfe823a7eec016205219559dc4b4e.zip" # forces replacement
      ~ output_name         = "functions/src_8f9b6f070b5694c891bb0a4dfa7e6715.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_8f9b6f070b5694c891bb0a4dfa7e6715.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1135,"Program":"tfcmt","SHA1":"96329af3e27e790f47efadb5f8a2de1dc69ad5bd","Vars":{},"WorkflowName":"CI / Infrastructure Develop"} -->